Revit 2024 API
AnalyticalEquipmentLoadData.Current Property
 The current of the analytical equipment load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public double Current { get; }
Visual Basic
Public ReadOnly Property Current As Double
	Get
Visual C++
public:
property double Current {
	double get ();
}
See Also
AnalyticalEquipmentLoadData Class
Autodesk.Revit.DB.Electrical Namespace